#bin/bash

#1. Найти все системные группы и получить толь их уникальные имена и id
cat /etc/group | awk -F ':' '{print $1,$3}'

#2. Найти все файлы и директории, который имеют права для доступа соответствующих user и group (к примеру root)
find / -user root -group root -print

#3. Найти все скрипты (или любой другой тип файлов на ваш выбор) в указанной директории и ее поддиректориях
find / -name *.bak

#4. Выполнить рекурсивный поиск слов или фразы для определенного типа файлов
grep --include=\*.FORMAT -rnw '/path/' -e 'Text'

#5. Рекурсивно изменить права доступа к файлу в заданной директории
chmod -R 711 /path/to/myfile

#6. Сравнить рекурсивно две директории и отобразить только отличающиеся файлы
diff -qr ./test1 ./test2

#7. Вывести список типов и количества активных сетевых соединений
ip -o -f inet addr show | awk '{print $2,$4,$9}'
netstat -an

#8. Переназначить существующую символьную ссылку.
ln -sfn ./file.txt symliname

#9. Найти все сломанные ссылки и удалить их.
find ./ -xtype -l -delete

#10. Рекурсивно скопировать структуру каталогов из указанной директории. (без файлов)
rsync -av -f"+ */" -f"- *" /home/lxuser/1 /home/lxuser/Downloads/

#11. Вывести список всех пользователей системы (только имена) по id
cat /etc/passwd | grep /bin/bash |awk -F ':' '{print "Name: "$1}'
